---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarInSystem.MaxSpacing
source: html/bc74c939-d06d-b245-c0a5-73c2452f3817.htm
---
# Autodesk.Revit.DB.Structure.RebarInSystem.MaxSpacing Property

Identifies the maximum spacing between rebar in rebar set.

## Syntax (C#)
```csharp
public double MaxSpacing { get; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.InapplicableDataException** - This rebar element represents a single bar (the layout rule is Single).